app/controllers/institutions_controller.rb

SELECT "institutions".* FROM "institutions"
---
  def index
    @institutions = Institution.all

INSERT INTO "institutions" ("name", "email", "cnpj", "address", "phone", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @institution = Institution.new(institution_params)

    respond_to do |format|
      if @institution.save

UPDATE "institutions" SET "email" = $1, "cnpj" = $2, "address" = $3, "updated_at" = $4 WHERE "institutions"."id" = $5  [["email", "contato@abrigonossolardf.com.br"], ["cnpj", " 00.444.059/0001-79"], ["address", "SAIS LOTE \"C\" Taguatinga DF"], ["updated_at", "2024-08-26 12:14:00.666902"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @institution.update(institution_params)

DELETE FROM "institutions" WHERE "institutions"."id" = $1  [["id", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
---
    def destroy
      @institution.products.destroy_all
      @institution.destroy

SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_institution
      @institution = Institution.find(params[:id])