app/controllers/products_controller.rb

SELECT "institutions".* FROM "institutions" WHERE "institutions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."institution_id" = $1  [["institution_id", 1]]
---
  def index
    if params[:institution_id].present?
      @institution = Institution.find(params[:institution_id])
      @products = @institution.products
    else
      @products = Product.all

INSERT INTO "products" ("name", "description", "quantity", "status", "institution_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save