app/views/products/_form.html.erb

    <%= form.label :institution_id, "Institution", class: "form-label" %>
    <%= form.collection_select :institution_id, Institution.all, :id, :name, { prompt: "Select an Institution" }, { class: "form-input" } %>
---
SELECT "institutions".* FROM "institutions"