app/views/products/index.html.erb

SELECT "institutions".* FROM "institutions"
---
      <%= form_with url: products_path, method: :get, local: true, class: "inline-block" do |f| %>
        <%= f.select :institution_id, options_from_collection_for_select(Institution.all, :id, :name, params[:institution_id]), { include_blank: "All Institutions" }, class: "form-select" %>